---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceSet.ReverseIterator
source: html/c8220f18-fab2-263b-4af6-2a2c23b6b0ed.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual SpaceSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.